Terraform plan for __ibo__
<details>
<summary>Plan: 2 to add, 1 to change, 0 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.inventory_events.google_pubsub_subscription.pull_subscriptions[0] will be created
  + resource "google_pubsub_subscription" "pull_subscriptions" {
      + ack_deadline_seconds       = 10
      + id                         = (known after apply)
      + message_retention_duration = "604800s"
      + name                       = "inventory-management-view"
      + path                       = (known after apply)
      + project                    = "ibo-prod"
      + topic                      = "inventory-management"

      + expiration_policy {
          + ttl = (known after apply)
        }
    }

  # module.inventory_events.google_pubsub_subscription_iam_member.pull_subscription_binding[0] will be created
  + resource "google_pubsub_subscription_iam_member" "pull_subscription_binding" {
      + etag         = (known after apply)
      + id           = (known after apply)
      + member       = "serviceAccount:service-435415796196@gcp-sa-pubsub.iam.gserviceaccount.com"
      + project      = "ibo-prod"
      + role         = "roles/pubsub.subscriber"
      + subscription = "inventory-management-view"
    }

  # module.jumpbox.kubernetes_deployment.jumpbox_deployment will be updated in-place
  ~ resource "kubernetes_deployment" "jumpbox_deployment" {
        id               = "default/jumpbox"
        # (1 unchanged attribute hidden)


      ~ spec {
            # (5 unchanged attributes hidden)



          ~ template {

              ~ spec {
                    # (11 unchanged attributes hidden)

                  ~ container {
                      ~ image                      = "us.gcr.io/ebo-dev-321910/jumpbox@sha256:8a79d9f2acdf9451591ecc27c7dc5b4531751f437a5905f3edaf302b5f6337da" -> "us.gcr.io/ebo-dev-321910/jumpbox@sha256:3210d8d60112ddd6d4335851f4b53fce7c9b929e55b43b5f639dbe1a70a76a91"
                        name                       = "jumpbox"
                        # (8 unchanged attributes hidden)

                        # (1 unchanged block hidden)
                    }

                    # (1 unchanged block hidden)
                }
                # (1 unchanged block hidden)
            }
            # (2 unchanged blocks hidden)
        }
        # (1 unchanged block hidden)
    }

Plan: 2 to add, 1 to change, 0 to destroy.

Warning: Provider kubernetes is undefined

  on jumpbox.tf line 3, in module "jumpbox":
   3:     kubernetes = kubernetes.gke

Module module.jumpbox does not declare a provider named kubernetes.
If you wish to specify a provider configuration for the module, add an entry
for kubernetes in the required_providers block within the module.
```
</details>

:memo: Plan generated in [Terraform #379](https://github.com/ebomart/commerce-infrastructure/actions/runs/1637113234)